In [31]:
import numpy as np
import pandas as pd

In [32]:
print(np.__version__ )
print(pd.__version__ )

2.1.1
2.2.3

In [33]:
df = pd.read_csv("Housing.csv")

In [34]:
df.head()

,price,area,bedrooms,bathrooms,stories,mainroad,guestroom,basement,hotwaterheating,airconditioning,parking,prefarea,furnishingstatus
0,13300000,7420.0,4,2,3,yes,no,no,no,yes,2.0,yes,furnished
1,12250000,8960.0,4,4,4,yes,no,no,no,yes,3.0,no,furnished
2,12250000,9960.0,3,2,2,yes,no,yes,no,no,2.0,yes,semi-furnished
3,12215000,7500.0,4,2,2,yes,no,yes,no,yes,3.0,yes,furnished
4,11410000,7420.0,4,1,2,yes,yes,yes,no,yes,2.0,no,furnished

In [35]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 545 entries, 0 to 544
Data columns (total 13 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   price             545 non-null    int64
 1   area              544 non-null    float64
 2   bedrooms          545 non-null    int64
 3   bathrooms         545 non-null    int64
 4   stories           545 non-null    int64
 5   mainroad          544 non-null    object
 6   guestroom         544 non-null    object
 7   basement          545 non-null    object
 8   hotwaterheating   542 non-null    object
 9   airconditioning   544 non-null    object
 10  parking           544 non-null    float64
 11  prefarea          545 non-null    object
 12  furnishingstatus  543 non-null    object
dtypes: float64(2), int64(4), object(7)
memory usage: 55.5+ KB

In [36]:
df.describe()

,price,area,bedrooms,bathrooms,stories,parking
count,5.450000e+02,544.000000,545.000000,545.000000,545.000000,544.000000
mean,4.766729e+06,5143.685662,2.965138,1.286239,1.805505,0.694853
std,1.870440e+06,2166.223271,0.738064,0.502470,0.867492,0.861864
min,1.750000e+06,1650.000000,1.000000,1.000000,1.000000,0.000000
25%,3.430000e+06,3596.000000,2.000000,1.000000,1.000000,0.000000
50%,4.340000e+06,4580.000000,3.000000,1.000000,2.000000,0.000000
75%,5.740000e+06,6360.000000,3.000000,2.000000,2.000000,1.000000
max,1.330000e+07,16200.000000,6.000000,4.000000,4.000000,3.000000

In [37]:
df.size

7085

In [38]:
df.shape

(545, 13)

In [39]:
df.nunique()

price               219
area                284
bedrooms              6
bathrooms             4
stories               4
mainroad              2
guestroom             2
basement              2
hotwaterheating       2
airconditioning       2
parking               4
prefarea              2
furnishingstatus      3
dtype: int64

In [40]:
df.columns

Index(['price', 'area', 'bedrooms', 'bathrooms', 'stories', 'mainroad',
       'guestroom', 'basement', 'hotwaterheating', 'airconditioning',
       'parking', 'prefarea', 'furnishingstatus'],
      dtype='object')

In [41]:
df['hotwaterheating'].unique()

array(['no', 'yes', nan], dtype=object)

In [42]:
df['parking'].value_counts()    #detect null values and their number

parking
0.0    298
1.0    126
2.0    108
3.0     12
Name: count, dtype: int64

In [43]:
df.isnull().sum()   #check null values

price               0
area                1
bedrooms            0
bathrooms           0
stories             0
mainroad            1
guestroom           1
basement            0
hotwaterheating     3
airconditioning     1
parking             1
prefarea            0
furnishingstatus    2
dtype: int64

In [44]:
df['bedrooms'].dtype

dtype('int64')

use mode to fill missing values

In [46]:
df['bedrooms'].fillna(np.mean(df['bedrooms']), inplace=True)

C:\Users\BJIT\AppData\Local\Temp\ipykernel_11764\1931992693.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['bedrooms'].fillna(np.mean(df['bedrooms']), inplace=True)

In [47]:
df.isnull().sum() #check null values

price               0
area                1
bedrooms            0
bathrooms           0
stories             0
mainroad            1
guestroom           1
basement            0
hotwaterheating     3
airconditioning     1
parking             1
prefarea            0
furnishingstatus    2
dtype: int64

In [48]:
df['bedrooms'].unique()

array([4, 3, 5, 2, 6, 1])

In [ ]:
df.describe().T     #how it is showed in practice

,count,mean,std,min,25%,50%,75%,max
price,545.0,4.766729e+06,1.870440e+06,1750000.0,3430000.0,4340000.0,5740000.0,13300000.0
area,544.0,5.143686e+03,2.166223e+03,1650.0,3596.0,4580.0,6360.0,16200.0
bedrooms,545.0,2.965138e+00,7.380639e-01,1.0,2.0,3.0,3.0,6.0
bathrooms,545.0,1.286239e+00,5.024696e-01,1.0,1.0,1.0,2.0,4.0
stories,545.0,1.805505e+00,8.674925e-01,1.0,1.0,2.0,2.0,4.0
parking,544.0,6.948529e-01,8.618640e-01,0.0,0.0,0.0,1.0,3.0

In [ ]:
df.iloc[6:9]    #filter based on position, excluding upperbound

,price,area,bedrooms,bathrooms,stories,mainroad,guestroom,basement,hotwaterheating,airconditioning,parking,prefarea,furnishingstatus
6,10150000,8580.0,4,3,4,yes,no,no,no,yes,2.0,yes,semi-furnished
7,10150000,16200.0,5,3,2,yes,no,no,no,no,0.0,no,unfurnished
8,9870000,8100.0,4,1,2,yes,yes,yes,no,yes,2.0,yes,furnished

In [ ]:
df.loc[6:9]     #based on label, both upper and lowerbounds included

,price,area,bedrooms,bathrooms,stories,mainroad,guestroom,basement,hotwaterheating,airconditioning,parking,prefarea,furnishingstatus
6,10150000,8580.0,4,3,4,yes,no,no,no,yes,2.0,yes,semi-furnished
7,10150000,16200.0,5,3,2,yes,no,no,no,no,0.0,no,unfurnished
8,9870000,8100.0,4,1,2,yes,yes,yes,no,yes,2.0,yes,furnished
9,9800000,5750.0,3,2,4,yes,yes,no,no,yes,1.0,yes,unfurnished

In [53]:
new_df = df[['area', 'bedrooms']]

In [54]:
new_df.to_csv("housing_area_bedrooms.csv", index=False)

In [56]:
housing_area_bedrooms = pd.read_csv("housing_area_bedrooms.csv")

In [57]:
housing_area_bedrooms.head()

     area  bedrooms
0  7420.0         4
1  8960.0         4
2  9960.0         3
3  7500.0         4
4  7420.0         4

In [61]:
pd.concat([df, housing_area_bedrooms], axis=1).head()

,price,area,bedrooms,bathrooms,stories,mainroad,guestroom,basement,hotwaterheating,airconditioning,parking,prefarea,furnishingstatus,area,bedrooms
0,13300000,7420.0,4,2,3,yes,no,no,no,yes,2.0,yes,furnished,7420.0,4
1,12250000,8960.0,4,4,4,yes,no,no,no,yes,3.0,no,furnished,8960.0,4
2,12250000,9960.0,3,2,2,yes,no,yes,no,no,2.0,yes,semi-furnished,9960.0,3
3,12215000,7500.0,4,2,2,yes,no,yes,no,yes,3.0,yes,furnished,7500.0,4
4,11410000,7420.0,4,1,2,yes,yes,yes,no,yes,2.0,no,furnished,7420.0,4

In [62]:
data = {
    'Employee': ['Alice', 'Bob', 'Charlie', 'David', 'Eva', 'Frank', 'Grace', 'Hannah', 'Ian', 'Jack'],
    'Department': ['Sales', 'Sales', 'HR', 'HR', 'IT', 'IT', 'Marketing', 'Marketing', 'Finance', 'Finance'],
    'Age': [34, 28, 45, 36, 25, 30, 29, 35, 40, 27],
    'Salary': [70000, 65000, 80000, 78000, 62000, 67000, 75000, 71000, 68000, 64000],
    'Years_of_Experience': [5, 3, 10, 7, 2, 4, 6, 8, 9, 3]
}

In [63]:
emp_df = pd.DataFrame(data)

In [64]:
emp_df

  Employee Department  Age  Salary  Years_of_Experience
0    Alice      Sales   34   70000                    5
1      Bob      Sales   28   65000                    3
2  Charlie         HR   45   80000                   10
3    David         HR   36   78000                    7
4      Eva         IT   25   62000                    2
5    Frank         IT   30   67000                    4
6    Grace  Marketing   29   75000                    6
7   Hannah  Marketing   35   71000                    8
8      Ian    Finance   40   68000                    9
9     Jack    Finance   27   64000                    3

In [71]:
emp_df.groupby('Department')['Employee'].count()

Department
Finance      2
HR           2
IT           2
Marketing    2
Sales        2
Name: Employee, dtype: int64